import os
import pandas as pd
from PIL import Image

# Пути к файлам и папкам
csv_path = 'C:/Users/User/Downloads/rtsd-public/full-gt.csv'
images_dir = 'C:/Users/User/Downloads/rtsd-public/full-frames/rtsd-frames'
labels_dir = 'labels'

# Список всех уникальных классов (из YAML)
classes = ['2_1', '1_23', '1_17', '3_24_n40', '8_2_1', '5_20', '3_24_n20', '5_19_1', '5_16', '3_25_n20', '6_16', '7_15',
           '2_2', '2_4','8_13_1', '4_2_1', '1_20_3', '1_25', '3_4_n8', '8_3_2', '3_4_1', '4_1_6', '4_2_3', '4_1_1',
           '1_33', '5_15_5', '3_27', '1_15', '4_1_2_1', '6_3_1', '8_1_1', '6_7', '5_15_3', '7_3', '1_19', '6_4', '8_1_4',
           '8_8', '1_16', '1_11_1', '6_6', '5_15_1', '7_2', '5_15_2', '7_12', '3_18', '5_6', '5_5', '7_4', '4_1_2', '8_2_2', '7_11',
           '3_24_n5', '1_22', '1_27', '2_3_2', '5_15_2_2', '1_8', '3_13_r5', '2_3', '8_3_3', '2_3_3', '7_7', '1_11',
           '8_13', '3_24_n30', '1_12_2', '1_20', '1_12', '3_24_n60', '3_24_n70', '3_24_n50', '3_32', '2_5', '3_1',
           '4_8_2', '3_20', '3_13_r4.5', '3_2', '2_3_6', '5_22', '5_18', '2_3_5', '7_5', '8_4_1', '3_13_r3.7',
           '3_14_r3.7', '1_2', '1_20_2', '4_1_4', '7_6', '8_1_3', '8_3_1', '4_3', '4_1_5', '8_2_3', '8_2_4', '3_24_n80',
           '1_31', '3_10', '4_2_2', '3_13_r2.5', '7_1', '3_28', '4_1_3', '5_4', '5_3', '3_25_n40', '3_13_r4', '6_8_2',
           '3_31', '6_2_n50', '3_24_n10', '3_25_n50', '1_21', '3_21', '1_13', '1_14', '6_2_n70', '2_3_4', '4_8_3',
           '6_15_2', '2_6', '3_18_2', '4_1_2_2', '1_7', '3_19', '1_18', '2_7', '8_5_4', '3_25_n80', '5_15_7', '5_14',
           '5_21', '1_1', '6_15_1', '3_4_n2', '8_6_4', '8_15', '4_5', '3_13_r4.2', '6_2_n60', '3_11_n23', '3_11_n9',
           '8_18', '8_4_4', '3_30', '5_7_1', '5_7_2', '1_5', '3_29', '6_15_3', '5_12', '3_16_n3', '3_13_r4.3', '1_30',
           '5_11', '1_6', '8_6_2', '6_8_3', '3_12_n10', '3_12_n6', '3_33', '3_11_n13','3_14_r2.7', '3_16_n1', '8_4_3',
           '5_8', '3_11_n20', '3_11_n5', '8_14', '3_11_n8', '3_4_n5', '8_17', '3_6',
           '3_14_r3', '1_26', '3_12_n5', '8_5_2', '6_8_1', '5_17', '1_10', '3_13_r3.5', '3_13_r3.3', '3_13_r4.1',
           '3_11_n17', '8_16', '3_13_r3','3_25_n70', '6_2_n20', '3_12_n3', '3_14_r3.5', '3_13_r3.9', '6_2_n40',
           '3_13_r5.2', '7_18','7_14', '8_23',
           ]
# Создаём папку labels, если её нет
os.makedirs(labels_dir, exist_ok=True)

# Загрузить CSV
df = pd.read_csv(csv_path)

# Очистить и привести к строке sign_class
df['sign_class'] = df['sign_class'].astype(str).str.strip()

# Посчитаем количество примеров на каждый класс
class_counts = df['sign_class'].value_counts()

# Счётчик
counter = 0

# Обработка каждого изображения
for filename in df['filename'].unique():
    image_path = os.path.join(images_dir, filename)
    label_path = os.path.join(labels_dir, os.path.splitext(filename)[0] + '.txt')

    counter += 1
    if counter % 1000 == 0:
        print(f"Обработано {counter} файлов...")

    if not os.path.exists(image_path):
        print(f'Пропущено (нет изображения): {image_path}')
        continue

    # Получение размеров изображения
    img = Image.open(image_path)
    img_w, img_h = img.size

    # Все объекты на изображении
    records = df[df['filename'] == filename]

    lines = []
    for _, row in records.iterrows():
        class_name = str(row['sign_class']).strip()

        if class_name not in classes:
            print(f"Неизвестный класс: {class_name}")
            continue

        class_id = classes.index(class_name)

        # YOLO-формат координат
        x_center = (row['x_from'] + row['width'] / 2) / img_w
        y_center = (row['y_from'] + row['height'] / 2) / img_h
        width = row['width'] / img_w
        height = row['height'] / img_h

        lines.append(f"{class_id} {x_center:.6f} {y_center:.6f} {width:.6f} {height:.6f}")

    # Записываем только если остались строки
    if lines:
        with open(label_path, 'w') as f:
            f.write("\n".join(lines) + '\n')